app/views/prototypes/edit.html.haml

SELECT `captured_images`.* FROM `captured_images` WHERE `captured_images`.`prototype_id` = 5
---
          .cover-image-upload#main_image_uploader
            = f.fields_for :captured_images, @prototype.captured_images.main.first do |image|