app/controllers/prototypes_controller.rb

SELECT  `prototypes`.* FROM `prototypes` WHERE `prototypes`.`id` = 5 LIMIT 1
SELECT  `captured_images`.* FROM `captured_images` WHERE `captured_images`.`prototype_id` = 6 AND `captured_images`.`status` = 0  ORDER BY `captured_images`.`id` ASC LIMIT 1
---
  def edit
    @prototype = Prototype.find(params[:id])
    @main = @prototype.captured_images.where(status: 0)

SELECT `prototypes`.* FROM `prototypes` WHERE `prototypes`.`id` IN (4, NULL)
UPDATE `prototypes` SET `title` = 'bbbbb', `catch_copy` = 'bb', `concept` = 'cc', `updated_at` = '2018-02-23 00:43:50' WHERE `prototypes`.`id` = 6
---
  def update
    @prototype = Prototype.find(params[:id])
    if @prototype.update(prototype_params)